<template>
  <section class="contact">
    <div class="contact__container">
      <div class="contact__title">
        Наши контакты
      </div>
      <div class="contact__body">
        <div class="contact__left-side">
          <ul class="contact__list">
            <li><img src="@/assets/img/icons/geo.svg" alt="" class="contact__icon">ООО «Чистая среда»
              414057, г.Астрахань, ул.Рождественского, 4
            </li>
            <li><img src="@/assets/img/icons/tel.svg" alt="" class="contact__icon">+7 (600) 313-5613</li>
            <li><img src="@/assets/img/icons/email.svg" alt="" class="contact__icon">info@clear-rf.ru</li>
          </ul>
          <div class="contact__social">
            <svg viewBox="0 0 47 39" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M43.3581 0.518445L2.72689 16.1866C-0.0460272 17.3003 -0.0299852 18.8472 2.21814 19.537L12.6498 22.7912L36.7856 7.56303C37.9269 6.86865 38.9696 7.24219 38.1125 8.00303L18.5577 25.6512H18.5531L18.5577 25.6534L17.8381 36.4059C18.8923 36.4059 19.3575 35.9224 19.9488 35.3518L25.0156 30.4247L35.555 38.2095C37.4983 39.2797 38.894 38.7297 39.3775 36.4105L46.2961 3.80469C47.0042 0.96532 45.2121 -0.320305 43.3581 0.518445V0.518445Z"
                fill="#A6A6A6" />
            </svg>
            <svg viewBox="0 0 54 33" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M52.7625 2.63161C53.136 1.38036 52.7625 0.459106 50.9738 0.459106H45.0675C43.5645 0.459106 42.8715 1.25432 42.4958 2.13202C42.4958 2.13202 39.492 9.45619 35.2373 14.2137C33.8603 15.5933 33.2348 16.031 32.4833 16.031C32.1075 16.031 31.5428 15.5933 31.5428 14.3397V2.63161C31.5428 1.12827 31.1288 0.459106 29.8778 0.459106H20.5898C19.6515 0.459106 19.0868 1.15577 19.0868 1.81806C19.0868 3.24119 21.2153 3.57119 21.4335 7.57702V16.2808C21.4335 18.1897 21.0893 18.5358 20.3378 18.5358C18.3353 18.5358 13.464 11.1772 10.5728 2.75765C10.0125 1.11911 9.4455 0.459106 7.93575 0.459106H2.025C0.3375 0.459106 0 1.25432 0 2.13202C0 3.69494 2.0025 11.4591 9.32625 21.7281C14.2088 28.7406 21.0825 32.5424 27.3443 32.5424C31.0995 32.5424 31.563 31.6991 31.563 30.2439V24.9433C31.563 23.2543 31.9185 22.9174 33.1088 22.9174C33.9863 22.9174 35.487 23.3574 38.9925 26.7377C42.9975 30.7458 43.6568 32.5424 45.9113 32.5424H51.8175C53.505 32.5424 54.351 31.6991 53.865 30.0308C53.3295 28.3716 51.417 25.9631 48.8813 23.1054C47.5043 21.4783 45.4388 19.7252 44.811 18.8474C43.9358 17.7222 44.1855 17.2204 44.811 16.2189C44.811 16.2189 52.011 6.07598 52.7603 2.63161H52.7625Z"
                    fill="#A6A6A6" />
            </svg>
            <svg viewBox="0 0 53 37" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M51.7431 6.29493C51.4438 5.22757 50.861 4.26125 50.0565 3.49867C49.2293 2.71265 48.2154 2.15039 47.1105 1.86496C42.9756 0.775078 26.4094 0.775079 26.4094 0.775079C19.5032 0.696503 12.5987 1.0421 5.73478 1.80991C4.62991 2.11643 3.61791 2.69125 2.7888 3.48326C1.97415 4.26709 1.38407 5.23367 1.07582 6.29272C0.335353 10.2818 -0.0244194 14.3322 0.0013589 18.3893C-0.0250624 22.4427 0.333827 26.4918 1.07582 30.4858C1.37747 31.5405 1.96534 32.5026 2.7822 33.2799C3.59906 34.0571 4.61628 34.6186 5.73478 34.9158C9.92476 36.0035 26.4094 36.0035 26.4094 36.0035C33.3245 36.0821 40.2378 35.7366 47.1105 34.9686C48.2154 34.6832 49.2293 34.1209 50.0565 33.3349C50.8711 32.5577 51.4502 31.5911 51.7409 30.5387C52.5007 26.5511 52.8701 22.4991 52.8439 18.4399C52.9011 14.3636 52.5321 10.2924 51.7431 6.29272V6.29493ZM21.1428 25.9281V10.8526L34.9259 18.3915L21.1428 25.9281Z"
                fill="#A6A6A6" />
            </svg>
          </div>
        </div>
        <div class="contact__right-side">
          <img src="@/assets/img/map.png" alt="">
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: "ContactSection"
};
</script>

<style scoped lang="scss">
.contact {
  margin-bottom: 17rem;

  &__title {
    font-size: 6.2rem;
    text-transform: uppercase;
    font-weight: bold;
    margin-bottom: 8rem;
  }

  &__body {
    display: flex;
    justify-content: space-between;

  }

  &__social {
    display: flex;
    gap: 4rem;
    //margin-top: 20rem;
    align-items: end;
    height: 65%;
    svg {
      cursor: pointer;
      width: 5.2rem;
      height: 3.5rem;
    }
    svg:hover {
      path {
        fill: black;
        transition: 0.2s;
      }
    }
  }

  &__right-side {
    img {
      height: 38.3rem;
      width: 71.7rem;
    }
  }

  &__icon {
    width: 2rem;
    height: 2rem;


  }

  &__list {
    display: flex;
    flex-direction: column;
    gap: 4rem;

    li {
      display: flex;
      gap: 2.5rem;
      align-items: center;
      font-size: 1.6rem;
      color: #292a3f;
    }
  }

}
</style>